zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA144/iar/startup_MCXA144.s
        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SecureFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

        PUBWEAK Reserved16_IRQHandler
        PUBWEAK Reserved16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved16_IRQHandler
        LDR     R0, =Reserved16_DriverIRQHandler
        BX      R0

        PUBWEAK CMC_IRQHandler
        PUBWEAK CMC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CMC_IRQHandler
        LDR     R0, =CMC_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH0_IRQHandler
        PUBWEAK DMA_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH0_IRQHandler
        LDR     R0, =DMA_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH1_IRQHandler
        PUBWEAK DMA_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH1_IRQHandler
        LDR     R0, =DMA_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH2_IRQHandler
        PUBWEAK DMA_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH2_IRQHandler
        LDR     R0, =DMA_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH3_IRQHandler
        PUBWEAK DMA_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH3_IRQHandler
        LDR     R0, =DMA_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH4_IRQHandler
        PUBWEAK DMA_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH4_IRQHandler
        LDR     R0, =DMA_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH5_IRQHandler
        PUBWEAK DMA_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH5_IRQHandler
        LDR     R0, =DMA_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH6_IRQHandler
        PUBWEAK DMA_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH6_IRQHandler
        LDR     R0, =DMA_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK DMA_CH7_IRQHandler
        PUBWEAK DMA_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_CH7_IRQHandler
        LDR     R0, =DMA_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK ERM0_SINGLE_BIT_IRQHandler
        PUBWEAK ERM0_SINGLE_BIT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ERM0_SINGLE_BIT_IRQHandler
        LDR     R0, =ERM0_SINGLE_BIT_DriverIRQHandler
        BX      R0

        PUBWEAK ERM0_MULTI_BIT_IRQHandler
        PUBWEAK ERM0_MULTI_BIT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ERM0_MULTI_BIT_IRQHandler
        LDR     R0, =ERM0_MULTI_BIT_DriverIRQHandler
        BX      R0

        PUBWEAK FMU0_IRQHandler
        PUBWEAK FMU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FMU0_IRQHandler
        LDR     R0, =FMU0_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY0_IRQHandler
        PUBWEAK GLIKEY0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY0_IRQHandler
        LDR     R0, =GLIKEY0_DriverIRQHandler
        BX      R0

        PUBWEAK MBC0_IRQHandler
        PUBWEAK MBC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MBC0_IRQHandler
        LDR     R0, =MBC0_DriverIRQHandler
        BX      R0

        PUBWEAK SCG0_IRQHandler
        PUBWEAK SCG0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SCG0_IRQHandler
        LDR     R0, =SCG0_DriverIRQHandler
        BX      R0

        PUBWEAK SPC0_IRQHandler
        PUBWEAK SPC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SPC0_IRQHandler
        LDR     R0, =SPC0_DriverIRQHandler
        BX      R0

        PUBWEAK VBAT0_IRQHandler
        PUBWEAK VBAT0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
VBAT0_IRQHandler
        LDR     R0, =VBAT0_DriverIRQHandler
        BX      R0

        PUBWEAK WUU0_IRQHandler
        PUBWEAK WUU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WUU0_IRQHandler
        LDR     R0, =WUU0_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_IRQHandler
        PUBWEAK CAN0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_IRQHandler
        LDR     R0, =CAN0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved36_IRQHandler
        PUBWEAK Reserved36_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved36_IRQHandler
        LDR     R0, =Reserved36_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved37_IRQHandler
        PUBWEAK Reserved37_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved37_IRQHandler
        LDR     R0, =Reserved37_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved38_IRQHandler
        PUBWEAK Reserved38_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved38_IRQHandler
        LDR     R0, =Reserved38_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO_IRQHandler
        PUBWEAK FLEXIO_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO_IRQHandler
        LDR     R0, =FLEXIO_DriverIRQHandler
        BX      R0

        PUBWEAK I3C0_IRQHandler
        PUBWEAK I3C0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C0_IRQHandler
        LDR     R0, =I3C0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved41_IRQHandler
        PUBWEAK Reserved41_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved41_IRQHandler
        LDR     R0, =Reserved41_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C0_IRQHandler
        PUBWEAK LPI2C0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C0_IRQHandler
        LDR     R0, =LPI2C0_DriverIRQHandler
        BX      R0

